<?xml version=1.0 encoding=UTF-8?>
<!DOCTYPE plist PUBLIC -//Apple//DTD PLIST 1.0//EN http://www.apple.com/DTDs/PropertyList-1.0.dtd>
<plist version=1.0>
<dict>
	<key>Description</key>
	<string>The Unarchiver is a much more capable replacement for "Archive Utility.app", the built-in archive unpacker program on Mac OS X. The Unarchiver is designed to handle many more formats than Archive Utility, and to better fit in with the design of the Finder.</string>
	<key>Identifier</key>
	<string>com.seedstore.whydah.munki.The_Unarchiver</string>

	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>The Unarchiver</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>Utilities/MacPaw/The_Unarchiver</string>
		<key>MUNKI_CATEGORY</key>
		<string>Utilities</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>The Unarchiver is a much more capable replacement for "Archive Utility.app", the built-in archive unpacker program on Mac OS X. The Unarchiver is designed to handle many more formats than Archive Utility, and to better fit in with the design of the Finder.</string>
			<key>developer</key>
			<string>MacPaw</string>
			<key>display_name</key>
			<string>%NAME%</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>postinstall_script</key>
			<string>#!/bin/sh

sudo /usr/bin/osascript -e 'display dialog "The Unarchiver successfully installed at /Users/Shared." with title "Success!" with text buttons {"Close"} default button 1'
exit 0

</string>
			<key>postuninstall_script</key>
			<string>#!/bin/sh

## edit if you want a post uninstall script.

exit 0

</string>
			<key>unattended_install</key>
			<false/>
			<key>unattended_uninstall</key>
			<false/>
		</dict>
	</dict>

	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.seedstore.whydah.download.The_Unarchiver</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/The_Unarchiver</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_root</key>
				<string>%RECIPE_CACHE_DIR%/The_Unarchiver</string>
				<key>dmg_path</key>
				<string>%RECIPE_CACHE_DIR%/The_Unarchiver.dmg</string>
			</dict>
			<key>Processor</key>
			<string>DmgCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%dmg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>

