<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>AppCleaner is a small application which allows you to thoroughly uninstall unwanted apps.</string>
	<key>Identifier</key>
	<string>com.seedstore.whydah.munki.AppCleaner</string>

	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>AppCleaner</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>Utilities/FreeMacSoft/AppCleaner</string>
		<key>MUNKI_CATEGORY</key>
		<string>Utilities</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>AppCleaner is a small application which allows you to thoroughly uninstall unwanted apps.</string>
			<key>icon_name</key>
			<string>AppCleaner.png</string>
			<key>developer</key>
			<string>FreeMacSoft</string>
			<key>display_name</key>
			<string>%NAME%</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>postinstall_script</key>
			<string>#!/bin/sh

## edit if you want a post install script.

exit 0

</string>
			<key>postuninstall_script</key>
			<string>#!/bin/sh

## edit if you want a post uninstall script.

exit 0

</string>
			<key>unattended_install</key>
			<false/>
			<key>unattended_uninstall</key>
			<false/>
		</dict>
	</dict>

	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.seedstore.whydah.download.AppCleaner</string>
	<key>Process</key>
	<array>
			<dict>
					<key>Arguments</key>
					<dict>
							<key>pkg_path</key>
							<string>%pathname%</string>
							<key>repo_subdirectory</key>
							<string>%MUNKI_REPO_SUBDIR%</string>
					</dict>
					<key>Processor</key>
					<string>MunkiImporter</string>
			</dict>
	</array>
	</dict>
	</plist>
