<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
<key>Description</key>
<string>Downloads the latest &apos;Slack&apos; and imports into Munki.</string>
<key>Identifier</key>
<string>com.seedstore.whydah.munki.Slack</string>
<key>Input</key>
<dict>
  <key>APP_FILENAME</key>
  <string>Slack</string>
  <key>MUNKI_CATEGORY</key>
  <string>Communication</string>
  <key>MUNKI_DEVELOPER</key>
  <string>Slack Technologies, Inc</string>
  <key>NAME</key>
  <string>Slack</string>
  <key>MUNKI_REPO_SUBDIR</key>
  <string>%MUNKI_CATEGORY%/%MUNKI_DEVELOPER%/%NAME%</string>

  <key>pkginfo</key>
  <dict>
    <key>catalogs</key>
    <array>
      <string>testing</string>
    </array>

    <key>description</key>
    <string>Slack is a platform for team communication: everything in one place, instantly searchable, available wherever you go.</string>
    <key>category</key>
    <string>%MUNKI_CATEGORY%</string>
    <key>icon_name</key>
    <string>Slack.png</string>
    <key>display_name</key>
    <string>Slack</string>
    <key>name</key>
    <string>%NAME%</string>
    <key>unattended_install</key>
    <false/>
  </dict>
</dict>

<key>MinimumVersion</key>
<string>0.2.0</string>
<key>ParentRecipe</key>
<string>com.seedstore.whydah.download.Slack</string>
<key>Process</key>
<array>
  <dict>
    <key>Arguments</key>
    <dict>
      <key>pkg_path</key>
      <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg</string>
      <key>repo_subdirectory</key>
      <string>%MUNKI_REPO_SUBDIR%</string>
      <key>version_comparison_key</key>
      <string>CFBundleShortVersionString</string>
    </dict>
    <key>Processor</key>
    <string>MunkiImporter</string>
  </dict>
</array>
</dict>
</plist>
