<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads Firefox disk image and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.seedstore.whydah.munki.firefox</string>
    <key>Input</key>
    <dict>
      <key>APP_FILENAME</key>
      <string>Firefox</string>
      <key>MUNKI_REPO_SUBDIR</key>
      <string>Internet/Mozilla/%NAME%</string>
      <key>MUNKI_CATEGORY</key>
      <string>Internet</string>
      <key>NAME</key>
      <string>Firefox</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Mozilla Firefox is a free and open source web browser.</string>
            <key>developer</key>
      			<string>Mozilla</string>
      			<key>category</key>
      			<string>%MUNKI_CATEGORY%</string>
      			<key>icon_name</key>
      			<string>Firefox.png</string>
      			<key>display_name</key>
      			<string>Firefox</string>
      			<key>name</key>
      			<string>%NAME%</string>
            <key>unattended_install</key>
            <false/>
            <key>unattended_uninstall</key>
            <false/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>2.0</string>
    <key>ParentRecipe</key>
    <string>com.seedstore.whydah.download.firefox</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
