<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of aplicativoitau and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.seedstore.whydah.munki.AppItau</string>
	<key>Input</key>
	<dict>
		<key>APP_FILENAME</key>
		<string>Itau</string>
		<key>NAME</key>
		<string>Itau</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>Utilities/Banco Itau S.A./%NAME%</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>O aplicativo do Itaú oferece um acesso seguro e prático para fazer a gestão da sua conta, ele dispensa o uso do Guardião 30 horas e você pode acessar sua conta física e jurídica. Seu atalho para um banco ainda mais seguro.</string>
			<key>icon_name</key>
			<string>Itau.png</string>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>developer</key>
			<string>Banco Itau S.A.</string>
			<key>display_name</key>
			<string>Itau</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<false/>
			<key>unattended_uninstall</key>
			<false/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.seedstore.whydah.download.AppItau</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
