<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
  <string>Spotify is a music streaming service offering unlimited streaming of selected music from a range of major and independent record labels.</string>
	<key>Identifier</key>
	<string>com.seedstore.whydah.munki.Spotify</string>
	<key>Input</key>
	<dict>
		<key>APP_FILENAME</key>
		<string>Spotify</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>Entertainment/Spotify AB/%NAME%</string>
		<key>MUNKI_CATEGORY</key>
		<string>Entertainment</string>
		<key>NAME</key>
		<string>Spotify</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
					<string>testing</string>
			</array>
      <key>description</key>
      <string>Spotify is a music streaming service offering unlimited streaming of selected music from a range of major and independent record labels.</string>
			<key>developer</key>
			<string>Spotify AB</string>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>icon_name</key>
			<string>Spotify.png</string>
			<key>display_name</key>
			<string>Spotify</string>
			<key>name</key>
			<string>%NAME%</string>
      <key>postinstall_script</key>
      <string>#!/bin/bash
          /bin/chmod -R go+rX /Applications/Spotify.app
			</string>
			<key>unattended_install</key>
			<false/>
			<key>unattended_uninstall</key>
			<false/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.seedstore.whydah.download.Spotify</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
