<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Android File Transfer disk image and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.seedstore.whydah.munki.AndroidFileTransfer</string>
    <key>Input</key>
    <dict>
      <key>APP_FILENAME</key>
      <string>Android File Transfer</string>
      <key>MUNKI_CATEGORY</key>
      <string>Utilities</string>
      <key>MUNKI_DEVELOPER</key>
      <string>Android, Inc</string>
      <key>NAME</key>
      <string>Android File Transfer</string>
      <key>MUNKI_REPO_SUBDIR</key>
      <string>%MUNKI_CATEGORY%/%MUNKI_DEVELOPER%/%NAME%</string>

        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Transfer files from Android to Mac via USB.</string>
            <key>display_name</key>
            <string>Android File Transfer</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.seedstore.whydah.download.AndroidFileTransfer</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
