<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>

    <key>Description</key>
    <string>Download the latest version of Discord and imports it into Munki.</string>
    <key>Identifier</key>
    <string>com.macsolution.seedstore.munki.Discord</string>
    <key>Input</key>
    <dict>
      <key>APP_FILENAME</key>
      <string>Discord</string>
      <key>MUNKI_CATEGORY</key>
      <string>Communication</string>
      <key>MUNKI_DEVELOPER</key>
      <string>Discord, Inc</string>
      <key>NAME</key>
      <string>Discord</string>
      <key>MUNKI_REPO_SUBDIR</key>
      <string>apps/%NAME%</string>

      <key>pkginfo</key>
      <dict>
        <key>catalogs</key>
        <array>
          <string>testing</string>
        </array>
        <key>description</key>
        <string>Discord is an instant messaging and VoIP social platform which allows communication through voice calls, video calls, text messaging, and media and files. Communication can be private or take place in virtual communities called "servers"</string>
        <key>developer</key>
  			<string>%MUNKI_DEVELOPER%</string>
  			<key>category</key>
  			<string>%MUNKI_CATEGORY%</string>
  			<key>icon_name</key>
  			<string>Discord.png</string>
  			<key>display_name</key>
  			<string>Discord</string>
  			<key>name</key>
  			<string>%NAME%</string>
  			<key>unattended_install</key>
  			<false/>
      </dict>
    </dict>

    <key>MinimumVersion</key>
    <string>0.3.0</string>
    <key>ParentRecipe</key>
    <string>com.macsolution.seedstore.download.Discord</string>

    <key>Process</key>
    <array>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>pkg_path</key>
          <string>%pathname%</string>
          <key>repo_subdirectory</key>
          <string>%MUNKI_REPO_SUBDIR%</string>
        </dict>
        <key>Processor</key>
        <string>MunkiImporter</string>
      </dict>
    </array>
  </dict>
</plist>
