<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string></string>
	<key>Identifier</key>
	<string>com.seedstore.whydah.munki.AdobeReader</string>

	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>AdobeReader</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>Utilities/Adobe/AdobeReader</string>
		<key>MUNKI_CATEGORY</key>
		<string>Utilities</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>Adobe® Reader® is the global standard for reliably viewing, printing, and commenting on PDF documents. It&apos;s the only PDF file viewer that can open and interact with all types of PDF content, including forms and multimedia.</string>
			<key>icon_name</key>
			<string>AdobeReader.png</string>
			<key>developer</key>
			<string>Adobe</string>
			<key>display_name</key>
			<string>%NAME%</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>preinstall_script</key>
      <string>#!/bin/sh
							if [ -e "/Applications/Adobe Reader.app" ]; then
							rm -r "/Applications/Adobe Reader.app"
							fi
							exit 0
      </string>
			<key>postinstall_script</key>
			<string>#!/bin/sh

							## edit if you want a post install script.

							exit 0

</string>
			<key>postuninstall_script</key>
			<string>#!/bin/sh

							## edit if you want a post uninstall script.

							exit 0
</string>
			<key>unattended_install</key>
			<false/>
			<key>unattended_uninstall</key>
			<false/>
		</dict>
	</dict>

	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.seedstore.whydah.download.AdobeReader</string>
	<key>Process</key>
	<array>
			<dict>
					<key>Arguments</key>
					<dict>
							<key>flat_pkg_path</key>
							<string>%pathname%/*.pkg</string>
							<key>destination_path</key>
							<string>%RECIPE_CACHE_DIR%/pkg_unpack</string>
							<key>purge_destination</key>
							<true/>
					</dict>
					<key>Processor</key>
					<string>FlatPkgUnpacker</string>
			</dict>
			<dict>
					<key>Arguments</key>
					<dict>
							<key>pkgroot</key>
							<string>%RECIPE_CACHE_DIR%/application_payload/Applications</string>
							<key>pkgdirs</key>
							<dict/>
					</dict>
					<key>Processor</key>
					<string>PkgRootCreator</string>
			</dict>
			<dict>
					<key>Arguments</key>
					<dict>
							<key>pkg_payload_path</key>
							<string>%RECIPE_CACHE_DIR%/pkg_unpack/application.pkg/Payload</string>
							<key>destination_path</key>
							<string>%RECIPE_CACHE_DIR%/application_payload/Applications</string>
							<key>purge_destination</key>
							<true/>
					</dict>
					<key>Processor</key>
					<string>PkgPayloadUnpacker</string>
			</dict>
			<dict>
					<key>Arguments</key>
					<dict>
							<key>faux_root</key>
							<string>%RECIPE_CACHE_DIR%/application_payload</string>
							<key>installs_item_paths</key>
							<array>
									<string>/Applications/Adobe Reader.app</string>
							</array>
					</dict>
					<key>Processor</key>
					<string>MunkiInstallsItemsCreator</string>
			</dict>
			<dict>
					<key>Processor</key>
					<string>MunkiPkginfoMerger</string>
			</dict>
			<dict>
					<key>Arguments</key>
					<dict>
							<key>pkg_path</key>
							<string>%pathname%</string>
							<key>repo_subdirectory</key>
							<string>%MUNKI_REPO_SUBDIR%</string>
					</dict>
					<key>Processor</key>
					<string>MunkiImporter</string>
			</dict>
	</array>
</dict>
</plist>
