<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.2.1 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Chrome and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.seedstore.whydah.munki.Chrome</string>
	<key>Input</key>
	<dict>
		<key>APP_FILENAME</key>
		<string>Google Chrome</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>Internet/Chrome</string>
		<key>MUNKI_CATEGORY</key>
		<string>Internet</string>
		<key>NAME</key>
		<string>Chrome</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>A free web browser developed by Google from the open source &lt;a href='//alternativeto.net/software/chromium/'&gt;Chromium&lt;/a&gt; project with a focus on speed and minimalism.</string>
			<key>developer</key>
			<string>Google, Inc.</string>
			<key>display_name</key>
			<string>Chrome</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<false/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.seedstore.whydah.download.Chrome</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
				<key>version_comparison_key</key>
				<string>CFBundleVersion</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
