<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads and Google Drive FileStream installer into Munki Repo</string>
    <key>Identifier</key>
    <string>com.seedsti\ore.whydah.munki.googledrivefs</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>Cloud/Google, Inc/Google FileStream</string>
        <key>MUNKI_CATEGORY</key>
    		<string>Cloud</string>
        <key>NAME</key>
        <string>GoogleFileStream</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Drive File Stream lets you:
• Access, search and manage files on-demand from your computer in seconds.
• Get just the files you need and make certain files available for offline use later.
• Access your work even quicker, as your most-used files become available in the background intelligently.
• Avoid the risk of users downloading all of your company data to their hard drives.</string>
            <key>display_name</key>
            <string>Google Drive FileStream</string>
            <key>icon_name</key>
            <string>GoogleFS.png</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <false/>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>developer</key>
            <string>Google, Inc</string>
            <key>blocking_applications</key>
            <array>
              <string>Google Drive File Stream</string>
            </array>
            <key>installer_choices_xml</key>
          	<array>
          		<dict>
          			<key>attributeSetting</key>
          			<integer>0</integer>
          			<key>choiceAttribute</key>
          			<string>selected</string>
          			<key>choiceIdentifier</key>
          			<string>com.google.pkg.Keystone</string>
          		</dict>
          	</array>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.3</string>
    <key>ParentRecipe</key>
    <string>com.seedstore.whydah.download.googledrivefs</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
