<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Microsoft Teams installer and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.seedstore.whydah.munki.MSTeams</string>
    <key>ParentRecipe</key>
    <string>com.seedstore.whydah.download.MSTeams</string>
    <key>Input</key>
    <dict>
      <key>MUNKI_CATEGORY</key>
      <string>Communication</string>
      <key>MUNKI_DEVELOPER</key>
      <string>Microsoft</string>
      <key>NAME</key>
      <string>Microsoft Teams</string>
      <key>MUNKI_REPO_SUBDIR</key>
      <string>%MUNKI_CATEGORY%/%MUNKI_DEVELOPER%/%NAME%</string>

        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Microsoft Teams is the new chat-centered workspace in Office 365. Keep all your content, tools, people, and conversations together in one place.</string>
            <key>developer</key>
      			<string>Microsoft</string>
      			<key>category</key>
      			<string>%MUNKI_CATEGORY%</string>
      			<key>icon_name</key>
      			<string>MSTeams.png</string>
      			<key>display_name</key>
      			<string>Microsoft Teams</string>
      			<key>name</key>
      			<string>%NAME%</string>
      			<key>unattended_install</key>
      			<false/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
