<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Visual Studio Code and imports into Munki.</string>
	<key>Identifier</key>
	<string>com.seedstore.whydah.munki.Visual_Studio_Code</string>

	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Visual_Studio_Code</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>Coding/Visual_Studio_Code</string>
		<key>MUNKI_CATEGORY</key>
		<string>Coding</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>Visual Studio Code is a code editor redefined and optimized for building and debugging modern web and cloud applications.</string>
			<key>developer</key>
			<string>GitHub, Inc.</string>
			<key>display_name</key>
			<string>Visual Studio Code</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>postinstall_script</key>
			<string>#!/bin/sh

curUser=$(/usr/bin/stat -f%Su /dev/console)

sudo launchctl asuser $curUser /usr/bin/osascript -e 'Tell current application to display dialog "Visual Studio Code has been successfullu installed." with title "Success!" with text buttons {"OK"} default button "OK"'

exit 0

</string>
			<key>postuninstall_script</key>
			<string>#!/bin/sh

sudo rm -rf $HOME/Library/Application\ Support/Code
sudo rm -rf $HOME/Library/Application\ Support/Code\ -\ Insiders/
sudo rm -rf $HOME/.vscode
sudo rm -rf $HOME/.vscode-insiders/
sudo rm -rf /Applications/Visual\ Studio\ Code.app/

exit 0
</string>
			<key>unattended_install</key>
			<false/>
			<key>unattended_uninstall</key>
			<false/>
		</dict>
	</dict>

	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.seedstore.whydah.download.Visual_Studio_Code</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_root</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>dmg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
			</dict>
			<key>Processor</key>
			<string>DmgCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%dmg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>