<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Acrobat Reader and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.seedstore.whydah.munki.AcrobatReader</string>
	<key>Input</key>
	<dict>
		<key>APP_FILENAME</key>
		<string>Adobe Acrobat Reader DC</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>Utilities/%NAME%</string>
		<key>MUNKI_CATEGORY</key>
		<string>Utilities</string>
		<key>NAME</key>
		<string>Acrobat Reader</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>Adobe Acrobat Reader DC.app</string>
				<string>NativeMessagingHost.app</string>
				<string>RdrServicesUpdater.app</string>
				<string>Acrobat Update Helper.app</string>
				<string>AcroInstallAlert.app</string>
				<string>Adobe Acrobat Updater.app</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Adobe Acrobat is a family of application software and web services developed by Adobe Systems to view, create, manipulate, print and manage files in Portable Document Format (PDF).</string>
			<key>icon_name</key>
			<string>Acrobat Reader.png</string>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>developer</key>
			<string>Adobe Systems, Inc.</string>
			<key>display_name</key>
			<string>Acrobat Reader</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<false/>
			<key>unattended_uninstall</key>
			<false/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.seedstore.whydah.download.AcrobatReader</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
